[
  {
    "type": "paragraph",
    "class": [],
    "content": [
      "The movie “Die Beautiful” is directed by Jun Robles Lana. This film tackles the themes of identity, resilience, and discrimination of the life of a transgender woman named Trisha Echevarria, who strives to live life on her own beautifully. Even in death, she seeks to showcase her identity as her best friend Barbs honors her wish by styling her as various iconic celebrities during her wake. It combines humor, drama, and social commentary to portray the complexities of LGBTQ+ life in the Philippines, highlighting its challenges and aspirations."
    ]
  },
  {
    "type": "paragraph",
    "class": [],
    "content": [
      "What struck me first was the transition between the past and present event of Trisha life, also it balanced the humor and grief so perfectly. There were the scenes that made us laugh but also a moment of intense sadness and anger. The contrast between the scenes made me realize how people use humor as a shield to protect ourselves from pain. It remains that every behind jokes, make up, confidence, there is a person who longs to be loved and respected by others."
    ]
  },
  {
    "type": "image",
    "class": [],
    "source": "https://raw.githubusercontent.com/MrNickCoder/AisatCritic/refs/heads/main/images/laya/1.jpg",
    "alt": ""
  },
  {
    "type": "paragraph",
    "class": [],
    "content": [
      "Paulo Ballesteros as Trisha, delivers an extraordinary performance. Through he’s acting, it’s really captured the characters confidence and humor, but also the sadness that comes from with it. His ability to shift between comedic into emotionally intense scenes, it really demonstrates well. After his character died, Trisha’s friend Barbs, played by Christian Bables, honoring her final wish by transforming her into different looks during her wake. It represents the final celebration of one’s identity, reclaiming what the society repeatedly tried to take away from you."
    ]
  },
  {
    "type": "image",
    "class": [],
    "source": "https://raw.githubusercontent.com/MrNickCoder/AisatCritic/refs/heads/main/images/laya/2.jpg",
    "alt": ""
  },
  {
    "type": "paragraph",
    "class": [],
    "content": ["One of the powerful parts of the film was the theme of letting go. Trisha’s family, especially his father don’t accept who truly she is, which was painful to watch. Also, how she was being taken advantage or ended up sexually assaulted by Migs and his friends. But the love she received from Barbs and her other friends was genuine and unconditional. Another reaction I had was anger, not in the movie but at the harsh realities it reveals. How the societal prejudice forces many of our LGBTQ+ individuals to build resilience early on in their lives. That’s how I admire them, even though the society pushes their down but their courage to teach us that being true to ourselves is one of the most beautiful and powerful things that we can do in our life."]
  },
  {
    "type": "image",
    "class": [],
    "source": "https://raw.githubusercontent.com/MrNickCoder/AisatCritic/refs/heads/main/images/laya/3.jpg",
    "alt": ""
  },
  {
    "type": "paragraph",
    "class": [],
    "content": ["Additionally, the title of this critique is called, “A Rose that died beautiful”. Why? For me, her life is like a rose but full of thorns. Trisha shines brightly, just like a rose in a full bloom. Despite the world trying to push her down, her beauty, confidence, and talent make her bloom and stand. But just like a rose, her life was also filled with sharp thorns. These thorns represent her struggle and hardship as she faces as a transgender woman. The rejection, discrimination, the way she was abused, and the constant battle to be respected as who she truly is. Every time she tries to bloom, there is pain around her, yet she never stops growing beautiful. Its beauty doesn’t disappear just because it’s life ends, like her She Die Beautiful."]
  }
]
