[
  {
    "type": "image",
    "class": [],
    "source": "https://raw.githubusercontent.com/MrNickCoder/AisatCritic/refs/heads/main/images/mingo/1.jpg",
    "alt": ""
  },
  {
    "type": "paragraph",
    "class": [],
    "content": [
      "Trisha’s relationship with her dad is tough and painful. Growing up, he didn’t really accept her and often treated her harshly, with judgment and misunderstanding. It’s clear his behavior comes from strict expectations and societal views, but it still hurt Trisha a lot. She is loud and proud about being a gay at young age, dreaming about winning a pageant. But because of his dad and society’s harsh words. That kind of rejection really affected her self-esteem and made her crave acceptance elsewhere, which is part of why her chosen family, like Shirley Mae (her adopted daughter), becomes so important. Even though it was painful, it also made her strong and empathetic. She learned to be resilient and caring, traits that shine through in how she loves and supports others. It’s a clear example of how parental rejection can leave deep scars but also show how she can give love even though the world is harsh to her."
    ]
  },
  {
    "type": "image",
    "class": [],
    "source": "https://raw.githubusercontent.com/MrNickCoder/AisatCritic/refs/heads/main/images/mingo/2.jpg",
    "alt": ""
  },
  {
    "type": "header",
    "class": [],
    "content": "Trisha faces Sexual Harassment & Exploitation"
  },
  {
    "type": "paragraph",
    "class": [],
    "content": [
      "Trisha go through a tough and probably the most painful she experiences in her life, when Migz invited him and then exploited his kindness. Making her a toy for him and to all his friend that night. Being targeted in this way leaves her feeling vulnerable, violated, and disrespected, highlighting the dangers that transgender individuals often face in society. These incidents highlight the prejudice, objectification, and vulnerability she experiences while pursuing her dreams and living authentically. Despite these hardships, Trisha remains resilient, using humor, determination, and her identity to navigate the obstacles in her life. This scene is a serious issue of harassment and abuse that many LGBTQ+ people endure, making her story both powerful and eye-opening. Not many people believe in a story like this, because everyone expects that “they want it” just because of someone’s identity."
    ]
  },
  {
    "type": "image",
    "class": [],
    "source": "https://raw.githubusercontent.com/MrNickCoder/AisatCritic/refs/heads/main/images/mingo/3.jpg",
    "alt": ""
  },
  {
    "type": "header",
    "class": [],
    "content": "TRISHA BEING A MOTHER"
  },
  {
    "type": "paragraph",
    "class": [],
    "content": [
      "Trisha being a mom to Shirley Mae really shows how loving and caring she is. Even though she’s not Shirley Mae’s biological mother, she gives her protection, guidance, and support like a real parent. She takes her away from a difficult and abusive environment, providing safety, and comfort. Through her daily care, teaching her, guiding her, and being there for her. Trisha shows that motherhood is about love, not blood. Their relationship highlights the power of chosen family, showing how love and support can help heal past wounds and help Shirley Mae grow with confidence and hope. She also taught Shirley about pregnancy that she should be careful about having s#x, she is honest and open, making sure Shirley Mae understands in a way that’s age appropriate. Through these conversations, Trisha emphasizes responsibility, respect, and self-awareness, helping Shirley Mae prepare for the changes and challenges that come with growing up."
    ]
  },
  {
    "type": "image",
    "class": [],
    "source": "https://raw.githubusercontent.com/MrNickCoder/AisatCritic/refs/heads/main/images/mingo/4.jpg",
    "alt": ""
  },
  {
    "type": "header",
    "class": [],
    "content": "BARBS, THE FRIEND WE ALL NEED OR BE BARBS"
  },
  {
    "type": "paragraph",
    "class": [],
    "content": [
      "Barbs role as Trisha’s best friend is really a warm in heart. Being a person who can be relay on even though she herself wants to lean on someone but chooses to be there for her friend, Trisha. Throughout her life and even after death, Barb’s there. Making sure she fulfils Trisha’s death wish, being different persona’s every other day for seven days. Also, she takes Trisha’s body so she can do her death wish.  A loyal, caring friend, whose always there for Trisha."
    ]
  },
  {
    "type": "image",
    "class": [],
    "source": "https://raw.githubusercontent.com/MrNickCoder/AisatCritic/refs/heads/main/images/mingo/5.jpg",
    "alt": ""
  },
  {
    "type": "header",
    "class": [],
    "content": "Trisha Echevarria, BEAUTY QUEEN"
  },
  {
    "type": "paragraph",
    "class": [],
    "content": [
      "Trisha shows incredible resilience, continuing to live authentically and assert her identity. After all the hardship she experienced, she chooses to be a good person, a caring friend, loving persons to all of her lover, and a selfless mother to her child, Shirley. Trisha’s got the title of being a beauty queen before she dies. She got the funeral she wants, that Barbs carefully plan every detail, making sure her farewell reflects her vibrant personality and the life she lived. Respecting everything she want to look like and even the clothes and gown that she would like. Even while grieving, they come together to honor her memory, proving the strength and love of chosen family. Their dedication shows that love and friendship can preserve a person’s legacy, keeping their spirit alive long after they’re gone."
    ]
  }
]
